Revit 2024 API
SplitButton Methods
The SplitButton type exposes the following members.
Methods
Name | Description
AddPushButton
Adds a new pushbutton to the pulldown button and associates it with an ExternalCommand.
 (Inherited from PulldownButton.)
AddSeparator
Adds a separator to the drop-down list.
 (Inherited from PulldownButton.)
Equals
 Determines whether the specified Object is equal to the current Object.
 (Inherited from RibbonItem.)
GetContextualHelp
Gets the contextual help bound with this control.
 (Inherited from RibbonItem.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetItems
Gets a copy of the collection of buttons assigned to the pulldown button.
 (Inherited from PulldownButton.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetContextualHelp
Sets the contextual help bound with this button.
 (Inherited from RibbonItem.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
SplitButton Class
Autodesk.Revit.UI Namespace